rsisghuendt/twigs/endt-gpa.twig

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pol="http://policymovements.webservices.uw.rs.firstapex.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <pol:FGUWPolicyVO>
            <oprId>GMCPOLICY</oprId>
            <polNo>GPP1000100047100</polNo>
            <endtNo>GPP1000100047100-001</endtNo>
            <IUWP1_ENQ_KEY_2>24AABCR7106G1ZP</IUWP1_ENQ_KEY_2>
            <IUWP1_POL_WARR>GPP100010000001</IUWP1_POL_WARR>
            <IUWP1_LINK_FLD>PRO2026789000000100</IUWP1_LINK_FLD>
            <endtNo>001</endtNo>
            <IUWP1_PRD_CD>APG</IUWP1_PRD_CD>
            <IUWP1_ENDT_REAS>01</IUWP1_ENDT_REAS>
            <IUWP1_CAT_CD>D</IUWP1_CAT_CD>
            <IUWP1_BR_CD>MN</IUWP1_BR_CD>
            <isNewAgent>N</isNewAgent>
            <isNewClient>N</isNewClient>
            <IUWP1_CLI_CD>AG020227</IUWP1_CLI_CD>
            <IUWP1_ACC_CD>AG020227</IUWP1_ACC_CD>
            <IUWP1_POL_NO_GEN_ID>M</IUWP1_POL_NO_GEN_ID>
            <IUWP1_DOM>URB</IUWP1_DOM>
            <IUWP1_TERR>TN</IUWP1_TERR>
            <IUWP1_QUOT_NO>PRO2026789000000100</IUWP1_QUOT_NO>
            <IUWP1_UWYR>2025</IUWP1_UWYR>
            <IUWP1_BUS_TP>CM</IUWP1_BUS_TP>
            <IUWP1_ORACC_CD>OA503184</IUWP1_ORACC_CD>
            <IUWP1_TERM>01</IUWP1_TERM>
            <IUWP1_METH_PAY>CASH</IUWP1_METH_PAY>
            <IUWP1_INSTL_MODE>A</IUWP1_INSTL_MODE>
            <nomineeUpdateFlag>N</nomineeUpdateFlag>
            <IUWP1_DELIVERY_MODE>N</IUWP1_DELIVERY_MODE>
            <IUWP1_RN_CD>00</IUWP1_RN_CD>
            <IUWP1_SI_CUR>INR</IUWP1_SI_CUR>
            <IUWP1_PRM_CUR>INR</IUWP1_PRM_CUR>
            <primeIUWP1_INCR_SI>50000000</primeIUWP1_INCR_SI>
            <IUWP1_DECLN_NO/>
            <IUWP1_ICP_DT>19/03/2026</IUWP1_ICP_DT>
            <IUWP1_EXP_DT>18/03/2027</IUWP1_EXP_DT>
            <IUWP1_ISS_DT>19/03/2026</IUWP1_ISS_DT>
            <IUWP1_ACC_DT>22/03/2026</IUWP1_ACC_DT>
            <IUWP1_EFF_DT>22/03/2026</IUWP1_EFF_DT>
            <IUWP1_PROPOSAL_DT>19/03/2026</IUWP1_PROPOSAL_DT>
            <strIUWP1_ICP_TM>000001</strIUWP1_ICP_TM>
            <strIUWP1_EXP_TM>000000</strIUWP1_EXP_TM>
            <clientUpdateFlag>N</clientUpdateFlag>
            <IUWP1_CLI_ADDR_1>Lodha Complex</IUWP1_CLI_ADDR_1>
            <IUWP1_CLI_ADDR_2></IUWP1_CLI_ADDR_2>
            <IUWP1_CLI_ADDR_3></IUWP1_CLI_ADDR_3>
            <vipFlag>N</vipFlag>
            <panNo/>
            <isNewNominee>N</isNewNominee>
            <nomineeCode/>
            <nomineeDesc/>
            <relationWithProposer/>
            <nomineeDOB/>
            <nomineeSex/>
            <nomineeMinorFlag/>
            <aadharNo/>
            <guardianAge/>
            <nomineeAddr1/>
            <nomineeAddr2/>
            <nomineeAddr3/>
            <IUWP1_OTH_INT_PTY_CD1>AG020227</IUWP1_OTH_INT_PTY_CD1>
            <IUWP1_OTH_INT_PTY_CD2>HR001888</IUWP1_OTH_INT_PTY_CD2>
            <IUWP1_OTH_INT_PTY_CD3>UW000919</IUWP1_OTH_INT_PTY_CD3>
            <IUWP1_OTH_INT_PTY_CD4>TU000919</IUWP1_OTH_INT_PTY_CD4>
            <clientVO>
                <cityCode></cityCode>
                <IUWPC_2ND_ZIP>400604</IUWPC_2ND_ZIP>
                <IUWPC_CAMPAIGN/>
                <IUWPC_CLI_EMAIL1>Test@gmali.com</IUWPC_CLI_EMAIL1>
                <IUWPC_CLI_TP>O</IUWPC_CLI_TP>
                <IUWPC_CON_CD>IND</IUWPC_CON_CD>
                <IUWPC_DOB/>
                <IUWPC_FIRSTNAME2>RSF</IUWPC_FIRSTNAME2>
                <IUWPC_HAND_PHONE>0</IUWPC_HAND_PHONE>
                <IUWPC_MARITAL_STATUS/>
                <IUWPC_OFF_PHONE/>
                <IUWPC_OTHRNAME2/>
                <IUWPC_SEX/>
                <IUWPC_STATE_CD>TN</IUWPC_STATE_CD>
                <IUWPC_SURNAME2/>
                <IUWPC_TRADE>1000</IUWPC_TRADE>
            </clientVO>
            <userTextVO>
                <IUWP1_ATEXT1/>
                <IUWP1_ATEXT2></IUWP1_ATEXT2>
                <IUWP1_ATEXT3>INSILLION</IUWP1_ATEXT3>
                <IUWP1_ATEXT5>100000</IUWP1_ATEXT5>
            </userTextVO>
            <settlementVOList>
                <IUWP1_ACC_CD>AG020227</IUWP1_ACC_CD>
                <IUWP1_STL_REF>CDAG020227</IUWP1_STL_REF>
                <IUWP1_STL_SRC>CD</IUWP1_STL_SRC>
                <IUWP1_STL_TYPE>CD</IUWP1_STL_TYPE>
            </settlementVOList>
            <policyCoverageVOList>
                <IUWP4_COVG_CD>ZIGST</IUWP4_COVG_CD>
                <IUWP4_PREM_CURR>INR</IUWP4_PREM_CURR>
                <IUWP4_PREM_CURR_RATE>1</IUWP4_PREM_CURR_RATE>
                <IUWP4_RT_U>18</IUWP4_RT_U>
                <primeIUWP4_NEW_INCR_PREM>4050</primeIUWP4_NEW_INCR_PREM>
            </policyCoverageVOList>
            <itemSectionVOList>
                <coverageVOList>
                    <IUWP3_COVG_CD>APDPRM</IUWP3_COVG_CD>
                    <IUWP3_DEDUCTIBLE_AMT>0</IUWP3_DEDUCTIBLE_AMT>
                    <IUWP3_RT_U>0</IUWP3_RT_U>
                    <primeIUWP3_INCR_PREM>22500</primeIUWP3_INCR_PREM>
                    <primeIUWP3_INCR_SI>50000000</primeIUWP3_INCR_SI>
                </coverageVOList>
                <IUWP2_COVER_CD>APG</IUWP2_COVER_CD>
                <IUWP2_DED_CODE/>
                <IUWP2_DESC3></IUWP2_DESC3>
                <IUWP2_DESC5></IUWP2_DESC5>
                <IUWP2_DESC7></IUWP2_DESC7>
                <IUWP2_DESC8></IUWP2_DESC8>
                <IUWP2_DESC9></IUWP2_DESC9>
                <IUWP2_DESC10></IUWP2_DESC10>
                <IUWP2_DESC12></IUWP2_DESC12>
                <IUWP2_ITEM_NO>00001</IUWP2_ITEM_NO>
                <IUWP2_MAP_REF_NO>0</IUWP2_MAP_REF_NO>
                <IUWP2_SECT_NO>01</IUWP2_SECT_NO>
                <IUWP2_ZIP_CD>400604</IUWP2_ZIP_CD>
                <IUWP2_WAR>CHENNAI</IUWP2_WAR>
                <IUWP2_TERR_CD>TN</IUWP2_TERR_CD>
                <primeIUWP2_INCR_SI>50000000</primeIUWP2_INCR_SI>
                <primeIUWP2_INCR_ACT_PREM>22500</primeIUWP2_INCR_ACT_PREM>
                <IUWP2_INT_CD/>
                <IUWP2_RSK_CAT>PA1</IUWP2_RSK_CAT>
                <IUWP2_SI_TP>G</IUWP2_SI_TP>
                <IUWP2_BAS_RT>0</IUWP2_BAS_RT>
                <IUWP2_EMLX>Test@gmali.com</IUWP2_EMLX>
                <rsPaVO>
                    <IUWP2_PA_CD>ST000004</IUWP2_PA_CD>
                    <IUWP2_PA_BR_NAME>Slf_Sps</IUWP2_PA_BR_NAME>
                    <IUWP2_PA_ID_DOCN>500</IUWP2_PA_ID_DOCN>
                    <IUWP2_PA_ID_DTY></IUWP2_PA_ID_DTY>
                    <IUWP2_PA_OCCUP_INS/>
                    <IUWP2_PA_BENFY_BR_NAME></IUWP2_PA_BENFY_BR_NAME>
                    <isBenfClient>N</isBenfClient>
                    <isInsuredClient>N</isInsuredClient>
                    <isInsuredNominee>N</isInsuredNominee>
                    <isNewBenf>N</isNewBenf>
                    <isNewInsured>N</isNewInsured>
                    <isUpdateInsured>N</isUpdateInsured>
                    <IUWP2_PA_TRADE>1000</IUWP2_PA_TRADE>
                    <IUWP2_PA_OCCUP_CAT>PAEE</IUWP2_PA_OCCUP_CAT>
                    <membershipNo/>
                    <uwBenfVO/>
                    <IUWP2_PA_OCCUP_CL>C104</IUWP2_PA_OCCUP_CL>
                    <IUWP2_PA_OCCUP_INS>100000</IUWP2_PA_OCCUP_INS>
                </rsPaVO>
                <rsAdditionalDetailsVO>
                    <IUWP2_ADDITIONAL_FIELD1>0</IUWP2_ADDITIONAL_FIELD1>
                    <IUWP2_ADDITIONAL_FIELD5/>
                    <IUWP2_ADDITIONAL_FIELD7>0</IUWP2_ADDITIONAL_FIELD7>
                    <IUWP2_ADDITIONAL_FIELD8>0</IUWP2_ADDITIONAL_FIELD8>
                    <IUWP2_ADDITIONAL_FIELD9/>
                    <IUWP2_ADDITIONAL_FIELD10>RSF</IUWP2_ADDITIONAL_FIELD10>
                    <IUWP2_ADDITIONAL_FIELD11>Test@gmali.com</IUWP2_ADDITIONAL_FIELD11>
                    <IUWP2_ADDITIONAL_FIELD12>9819294951</IUWP2_ADDITIONAL_FIELD12>
                    <IUWP2_ADDITIONAL_FIELD40>0</IUWP2_ADDITIONAL_FIELD40>
                    <IUWP2_ADDITIONAL_FIELD41>0</IUWP2_ADDITIONAL_FIELD41>
                    <IUWP2_ADDITIONAL_FIELD42>0</IUWP2_ADDITIONAL_FIELD42>
                    <IUWP2_ADDITIONAL_FIELD43>0</IUWP2_ADDITIONAL_FIELD43>
                    <IUWP2_ADDITIONAL_FIELD44>0</IUWP2_ADDITIONAL_FIELD44>
                    <IUWP2_ADDITIONAL_FIELD45>0</IUWP2_ADDITIONAL_FIELD45>
                    <IUWP2_ADDITIONAL_FIELD46>0</IUWP2_ADDITIONAL_FIELD46>
                    <IUWP2_ADDITIONAL_FIELD47>0</IUWP2_ADDITIONAL_FIELD47>
                    <IUWP2_ADDITIONAL_FIELD48>0</IUWP2_ADDITIONAL_FIELD48>
                    <IUWP2_ADDITIONAL_FIELD49>0</IUWP2_ADDITIONAL_FIELD49>
                    <IUWP2_ADDITIONAL_FIELD50>0</IUWP2_ADDITIONAL_FIELD50>
                </rsAdditionalDetailsVO>
            </itemSectionVOList>
            <IUWP1_SB_OPT>G</IUWP1_SB_OPT>
        </pol:FGUWPolicyVO>
    </soapenv:Body>
</soapenv:Envelope>
